In [13]:
#convention for importing pandas
import pandas as pd

# Series

In [ ]:

days = pd.Series(['Monday','Tuesday','Wednesday'])
days

In [5]:
#creating series with a numpy array
import numpy as np
days_list = np.array(['Monday','Tuesday','Wednesday'])
numpy_days = pd.Series(days_list)
numpy_days

0       Monday
1      Tuesday
2    Wednesday
dtype: object

In [6]:
#using strings as index
days = pd.Series(['Monday','Tuesday','Wednesday'], index=['a','b','c'])
days

a       Monday
b      Tuesday
c    Wednesday
dtype: object

In [7]:
#create strings from a dictionary
days1 = pd.Series({'a':'Monday','b':'Tuesday','c':'Wednesday'})
days1

a       Monday
b      Tuesday
c    Wednesday
dtype: object

In [12]:
# series can be accessed using specified inndex
days[0]
days['a']
days1['a']

'Monday'

# DataFrames

In [15]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [20]:
# creating a dataframe from a dictionary
df_dict = {'Country':['Ghana','Kenya','Nigeria','Togo'],'Capital':['Accra','Nairobi','Abuja','Lome'],'Population':[1000,8500,35000,12000],'Age':[60,70,80,75]}
df = pd.DataFrame(df_dict, index=[2,4,6,8])
df

   Country  Capital  Population  Age
2    Ghana    Accra        1000   60
4    Kenya  Nairobi        8500   70
6  Nigeria    Abuja       35000   80
8     Togo     Lome       12000   75

In [21]:
#select the row in the at index 3
df.iloc[3]

Country        Togo
Capital        Lome
Population    12000
Age              75
Name: 8, dtype: object

In [23]:
#select row with index label 6
df.loc[6]

Country       Nigeria
Capital         Abuja
Population      35000
Age                80
Name: 6, dtype: object

In [24]:
#select the capital column
df['Capital']

2      Accra
4    Nairobi
6      Abuja
8       Lome
Name: Capital, dtype: object

In [25]:
#...........
df['Population'].sum()

56500

In [26]:
df.mean()

C:\Users\Mary Solomon\AppData\Local\Temp\ipykernel_9844\3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Population    14125.00
Age              71.25
dtype: float64

In [27]:
df.describe()

         Population        Age
count      4.000000   4.000000
mean   14125.000000  71.250000
std    14653.640048   8.539126
min     1000.000000  60.000000
25%     6625.000000  67.500000
50%    10250.000000  72.500000
75%    17750.000000  76.250000
max    35000.000000  80.000000

In [32]:
df_dict2 = {'Name':['James','Yemen','Cara',np.nan],'Profession':['Researcher','Artist','Doctor','Writer'],'Experience':[12,np.nan,10,8],'Height':[np.nan,175,180,150]}
df2 = pd.DataFrame(df_dict2)
df2

    Name  Profession  Experience  Height
0  James  Researcher        12.0     NaN
1  Yemen      Artist         NaN   175.0
2   Cara      Doctor        10.0   180.0
3    NaN      Writer         8.0   150.0

In [33]:
#check for cells with missing values as True
df2.isnull()

    Name  Profession  Experience  Height
0  False       False       False    True
1  False       False        True   False
2  False       False       False   False
3   True       False       False   False

In [34]:
#remove rows with missing values
df2.dropna()

   Name Profession  Experience  Height
2  Cara     Doctor        10.0   180.0